etf_pool = [
    "513100",   # 纳指ETF
    "159985",   # 豆粕ETF
    "518880",   # 黄金ETF
    "161226",   # 国投白银LOF
    "162411",   # 华宝油气ETF
    # "512690",   # 酒ETF
    "sz399987",   # 中证酒
    "510310",   # 沪深300ETF
    "512100",   # 中证1000ETF
    "159915",   # 创业板ETF
    # "515220",   # 煤炭ETF
    "sz399998",   # 中证煤炭
    # "159869",   # 游戏ETF
    "csi930901",   # 动漫游戏
    'sh000813',   # 细分化工
    "512890",   # 红利低波ETF
    # "csi990001",    # 中华半导体芯片
    "512480",   # 半导体ETF
    "513050",   # 中概互联网ETF
    # "513010",   # 恒生科技30ETF
    "002714",  # 牧原股份
#    "159866", # 日经ETF
    # "159652", # 有色50ETF
#    "159819", # 人工智能ETF
#    "562500", # 机器人ETF
#    "516510", # 云计算ETF
#    "159667", # 工业母机ETF
#    "512660", # 军工ETF
#    "159647", # 中药ETF
#    "159766", # 旅游ETF
#    "516150", # 稀土ETF
#    "159786", # VRETF
#    "515250", # 智能汽车ETF
#    "512670", # 国防ETF
#    "159790", # 碳中和ETF
#    "159781", # 科创创业ETF
#    "159755", # 电池ETF
#    "588000", # 科创50ETF
#    "515790", # 光伏ETF
#    "512400", # 有色金属ETF
#    "512290", # 生物医药ETF
#    "159992", # 创新药ETF
#    "515700", # 新能车ETF
    # "512290", # 生物医药ETF
    ]
