etf_pool = [
    "513100",  # 纳指ETF
    "159985",  # 豆粕ETF
    "518880",  # 黄金ETF
    "162411",  # 华宝油气ETF
    "512690",  # 酒ETF
    # "sz399987",   # 中证酒
    "510310",  # 沪深300ETF
    "512100",  # 中证1000ETF
    "159915",  # 创业板ETF
    "515220",  # 煤炭ETF
    # "sz399998",   # 中证煤炭
    "159869",  # 游戏ETF
    # "csi930901",   # 动漫游戏
    # 'sh000813',   # 细分化工
    "512890",  # 红利低波ETF
    # "csi990001",    # 中华半导体芯片
    "512480",  # 半导体ETF
    "513050",  # 中概互联网ETF
    # "513010",   # 恒生科技30ETF
    # "002714",  # 牧原股份
    # "601919",  # 中远海控
    "515880",  # 通信ETF
    "512800",  # 银行ETF
    # "931160",  # 通信设备
    "159866",  # 日经ETF
    "159652",  # 有色50ETF
    "159819",  # 人工智能ETF
    "562500",  # 机器人ETF
    "516510",  # 云计算ETF
    "159667",  # 工业母机ETF
    "512660",  # 军工ETF
    "159647",  # 中药ETF
    "159766",  # 旅游ETF
    "516150",  # 稀土ETF
    "159786",  # VRETF
    "515250",  # 智能汽车ETF
    "512670",  # 国防ETF
    "159790",  # 碳中和ETF
    "159781",  # 科创创业ETF
    "159755",  # 电池ETF
    "588000",  # 科创50ETF
    "515790",  # 光伏ETF
    "512400",  # 有色金属ETF
    "512290",  # 生物医药ETF
    "159992",  # 创新药ETF
    "515700",  # 新能车ETF
    "515900",  # 博时央企创新驱动ETF
    "513310",  # 华泰柏瑞中韩半导体ETF(QDII)
    "563000",  # 易方达MSCI中国A50互联互通ETF
    "516110",  # 国泰中证800汽车与零部件ETF
    "159937",  # 博时黄金ETF
    "512380",  # 银华MSCI中国A股ETF
    "515170",  # 华夏中证细分食品饮料主题ETF
    "561550",  # 华泰柏瑞中证500增强策略ETF
    "513060",  # 博时恒生医疗保健(QDII-ETF)
    "159870",  # 鹏华中证细分化工产业ETF
    "159967",  # 华夏创成长ETF
    "561560",  # 华泰柏瑞中证全指电力公用事业ETF
    "513550",  # 华泰柏瑞中证港股通50ETF
    "512000",  # 华宝券商ETF
    "513330",  # 华夏恒生互联网科技业ETF(QDII)
    "588050",  # 工银上证科创50成份ETF
    "588360",  # 国泰中证科创创业50ETF
    "516970",  # 广发中证基建工程ETF
    "159867",  # 鹏华中证畜牧养殖ETF
    "513130",  # 华泰柏瑞南方东英恒生科技(QDII-ETF)
    "516880",  # 银华中证光伏产业ETF
    "517000",  # 银华中证沪港深500ETF
    "513660",  # 华夏沪港通恒生ETF
    "159930",  # 汇添富中证能源ETF
    "513500",  # 博时标普500ETF
    "510800",  # 建信上证50ETF
    "159997",  # 天弘中证电子ETF
    "159995",  # 华夏国证半导体芯片ETF
    "159966",  # 华夏创蓝筹ETF
    "513030",  # 华安德国(DAX)ETF(QDII)
    "159920",  # 华夏恒生ETF(QDII)
    "512260",  # 华安中证低波动ETF
    "512170",  # 华宝中证医疗ETF
    "515000",  # 华宝中证科技龙头ETF
    "513000",  # 易方达日经225ETF
    "159949",  # 华安创业板50ETF
    "510300",  # 华泰柏瑞沪深300ETF
    "159938",  # 广发中证全指医药卫生ETF
    "159902",  # 华夏中小企业100ETF
    "510880",  # 华泰柏瑞上证红利ETF
    "512880",  # 国泰中证全指证券公司ETF
    "510050",  # 华夏上证50ETF
    "159981",  # 能源化工ETF
    "164824",  # 印度基金LOF
    "161128",  # 标普LOF
    "513970",  # 恒生消费ETF
]
